Klagopsalmer/TRF7970ABP_FR4133_FRL_Reader/driverlib/MSP430FR2xx_4xx/sysctl.h
//*****************************************************************************
//
// The following are deprecated values. These were updated to new names to add
// compatibility across Texas Instruments microcontrollers.
//
//*****************************************************************************
#ifndef DEPRECATED
#define SYS_BSLRAMASSIGN_NORAM                        SYSCTL_BSLRAMASSIGN_NORAM
#define SYS_BSLRAMASSIGN_LOWEST16BYTES        SYSCTL_BSLRAMASSIGN_LOWEST16BYTES
#define SYS_JTAGMBSIZE_16BIT                            SYSCTL_JTAGMBSIZE_16BIT
#define SYS_JTAGMBSIZE_32BIT                            SYSCTL_JTAGMBSIZE_32BIT
#define SYS_JTAGINBOX0AUTO_JTAGINBOX1AUTO  SYSCTL_JTAGINBOX0AUTO_JTAGINBOX1AUTO
#define SYS_JTAGINBOX0AUTO_JTAGINBOX1SW      SYSCTL_JTAGINBOX0AUTO_JTAGINBOX1SW
#define SYS_JTAGINBOX0SW_JTAGINBOX1AUTO      SYSCTL_JTAGINBOX0SW_JTAGINBOX1AUTO
#define SYS_JTAGINBOX0SW_JTAGINBOX1SW          SYSCTL_JTAGINBOX0SW_JTAGINBOX1SW
#define SYS_JTAGOUTBOX_FLAG0                            SYSCTL_JTAGOUTBOX_FLAG0
#define SYS_JTAGOUTBOX_FLAG1                            SYSCTL_JTAGOUTBOX_FLAG1
#define SYS_JTAGINBOX_FLAG0                              SYSCTL_JTAGINBOX_FLAG0
#define SYS_JTAGINBOX_FLAG1                              SYSCTL_JTAGINBOX_FLAG1
#define SYS_JTAGINBOX_0                                      SYSCTL_JTAGINBOX_0
#define SYS_JTAGINBOX_1                                      SYSCTL_JTAGINBOX_1
#define SYS_JTAGOUTBOX_0                                    SYSCTL_JTAGOUTBOX_0
#define SYS_JTAGOUTBOX_1                                    SYSCTL_JTAGOUTBOX_1
#define SYS_BSLENTRY_INDICATED                        SYSCTL_BSLENTRY_INDICATED
#define SYS_BSLENTRY_NOTINDICATED                  SYSCTL_BSLENTRY_NOTINDICATED
#define SYS_FRAMWRITEPROTECTION_DATA            SYSCTL_FRAMWRITEPROTECTION_DATA
#define SYS_FRAMWRITEPROTECTION_PROGRAM      SYSCTL_FRAMWRITEPROTECTION_PROGRAM
#define SYS_INFRAREDDATASOURCE_CONFIG          SYSCTL_INFRAREDDATASOURCE_CONFIG
#define SYS_INFRAREDDATASOURCE_IRDATA          SYSCTL_INFRAREDDATASOURCE_IRDATA
#define SYS_INFRAREDMODE_ASK                            SYSCTL_INFRAREDMODE_ASK
#define SYS_INFRAREDMODE_FSK                            SYSCTL_INFRAREDMODE_FSK
#define SYS_INFRAREDPOLARITY_NORMAL              SYSCTL_INFRAREDPOLARITY_NORMAL
#define SYS_INFRAREDPOLARITY_INVERTED          SYSCTL_INFRAREDPOLARITY_INVERTED
#endif

//*****************************************************************************
//
// The following are deprecated API names. These were updated to new names to
// add compatibility across Texas Instruments microcontrollers.
//
//*****************************************************************************
#ifndef DEPRECATED
#define SYS_enableDedicatedJTAGPins              SysCtl_enableDedicatedJTAGPins
#define SYS_getBSLEntryIndication                  SysCtl_getBSLEntryIndication
#define SYS_enablePMMAccessProtect                SysCtl_enablePMMAccessProtect
#define SYS_enableRAMBasedInterruptVectors                                    \
    SysCtl_enableRAMBasedInterruptVectors
#define SYS_disableRAMBasedInterruptVectors                                   \
    SysCtl_disableRAMBasedInterruptVectors
#define SYS_enableBSLProtect                            SysCtl_enableBSLProtect
#define SYS_disableBSLProtect                          SysCtl_disableBSLProtect
#define SYS_enableBSLMemory                              SysCtl_enableBSLMemory
#define SYS_disableBSLMemory                            SysCtl_disableBSLMemory
#define SYS_setRAMAssignedToBSL                      SysCtl_setRAMAssignedToBSL
#define SYS_JTAGMailboxInit                              SysCtl_JTAGMailboxInit
#define SYS_getJTAGMailboxFlagStatus            SysCtl_getJTAGMailboxFlagStatus
#define SYS_clearJTAGMailboxFlagStatus        SysCtl_clearJTAGMailboxFlagStatus
#define SYS_getJTAGInboxMessage16Bit            SysCtl_getJTAGInboxMessage16Bit
#define SYS_getJTAGInboxMessage32Bit            SysCtl_getJTAGInboxMessage32Bit
#define SYS_setJTAGOutgoingMessage16Bit      SysCtl_setJTAGOutgoingMessage16Bit
#define SYS_setJTAGOutgoingMessage32Bit      SysCtl_setJTAGOutgoingMessage32Bit
#define SYS_protectFRAMWrite                            SysCtl_protectFRAMWrite
#define SYS_enableFRAMWrite                              SysCtl_enableFRAMWrite
#define SYS_setInfraredConfig                          SysCtl_setInfraredConfig
#define SYS_enableInfrared                                SysCtl_enableInfrared
#define SYS_disableInfrared                              SysCtl_disableInfrared
#define SYS_getInfraredData                              SysCtl_getInfraredData
#endif

//*****************************************************************************
//
// The following are deprecated struct names. These were updated to new names
// to add compatibility across Texas Instruments microcontrollers.
//
//*****************************************************************************
#ifndef DEPRECATED
#endif

//*****************************************************************************
//
// Mark the end of the C bindings section for C++ compilers.
//
//*****************************************************************************
#ifdef __cplusplus
}
#endif

#endif
#endif // __MSP430WARE_SYSCTL_H__
